app/Http/Controllers/Main.php

select * from `albums` order by `titre` asc
---
    public function lesAlbums(Request $request)
    {
        $query = Album::query();
        // tri par date
        if ($request->filled('date')) {
            $order = $request->input('date') === 'asc' ? 'asc' : 'desc';
            $query->orderBy('creation', $order);
        } else {
            $query->orderBy('titre', 'asc');
        }

        //tri par recherche
        if ($request->filled('search')) {
            $search = $request->input('search');
            $query->where('titre', 'LIKE', "%{$search}%");
        }

        $lesAlbums = $query->get();

select * from `albums` order by `titre` asc
select * from `tags` order by `nom` asc
---
    public function ajoutPhoto()
    {
        $albums = Album::orderBy('titre')->get();
        $tags = Tag::orderBy('nom')->get();