app/Http/Controllers/Main.php

select * from `photos` where `photos`.`album_id` in (1, 2, 3, 4)
---
    public function lesAlbums(Request $request)
    {
        $lesAlbums = Album::with('photos')->get();